"""
    Написать функцию, которая будет отображать текст символами азбуки Морзе.
"""

MORSE_CODE_MAP = {
    "A": "•-",
    "B": "-•••",
    "C": "-•-•",
    "D": "-••",
    "E": "•",
    "F": "••-•",
    "G": "--•",
    "H": "••••",
    "I": "••",
    "J": "•---",
    "K": "-•-",
    "L": "•-••",
    "M": "--",
    "N": "-•",
    "O": "---",
    "P": "•--•",
    "Q": "--•-",
    "R": "•-•",
    "S": "•••",
    "T": "-",
    "U": "••-",
    "V": "•••-",
    "W": "•--",
    "X": "-••-",
    "Y": "-•--",
    "Z": "--••",
}


def main():
    s = input("Enter your text: ")


if __name__ == "__main__":
    main()
