"""
    1. Вводим строку.

    Если длина строки больше 5, вывести первые три символа в верхнем регистре и
    последние три символа в нижнем регистре.

    Иначе вывести первый символ с измененным регистром столько раз,
    какова длина строки.
"""

# s = input('1. Enter some string: ')
s = "Hello woRlD"


"""
    2. Определить, является ли строка палиндромом.
    aba == aba
    anna == anna
    python != nohtyp
"""


"""
    3. Удалить из строки повторяющиеся символы и пробелы.
"""

# s = input('3. Enter some string: ')
s = "Hello woR lD"


"""
    4. Посчитать количество цифр, строчных и заглавных букв в строке.
"""

# s = input('4. Enter some string: ')
s = "pyth$on DjangO 123 %@#2020 Basic!"


"""
    5. Убрать из строки знаки препинания.
"""

# s = input('5. Enter some string: ')
