"""
    Объявить переменные name, age, city,
    присвоив им значения с помощью input().
    Вывести на экран текст типа:
    Max from Kiev
    He is 21
"""

name = input('Input your name: ')
age = input('Input your age: ')
city = input('Input your city: ')
print('\n', name, 'from', city, 'at the age of', age, 'works in a highly paid job')
