"""
    В дополнение к degrees_0 реализуйте функцию make_mistakes,
    которая принимает список словарей и в к каждом рядке в случайной колонке
    заменяет значение на 0 либо '?'.

    1. Создайте список данных, используя функцию parse_data из degrees_0
    2. Отсортируйте данные используя функцию sort_data из degrees_0
    3. Повредите данные функцией make_mistakes
    4. Выведите результат с помощью функции show_data из degrees_0

    Пример вывода результата:
    °C     °F     °K
    0      212.0  373.15
    90.0   194.0  0
    80.0   0      353.15
    ...
"""
